title: Process created urlhaus_17_Zoom 14.vbs
description: 'Process created: urlhaus_17_Zoom 14.vbs (urlhaus_17_Zoom 14.vbs --urlhaus-validation)'
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
    Image|endswith: urlhaus_17_Zoom 14.vbs
  selection_cmdline:
    CommandLine|contains: urlhaus_17_Zoom 14.vbs --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- Image
- CommandLine
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_17_Zoom 14.vbs (urlhaus_17_Zoom
      14.vbs --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_17_Zoom 14.vbs
      pid: 9017
      command_line: urlhaus_17_Zoom 14.vbs --urlhaus-validation
    source_behavior_tags:
    - process_create
    platform_context: windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for windows telemetry from executable
      and command line evidence using: CommandLine|contains, Image|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:17+00:00'
    source_report_hash: null
    content_hash: 5e9b9418a63ff231a993b294c71649ad24f110f59b69d2133993dfe851de00d9
id: a4c267f1-0d44-5304-9653-23cf5d94ad95
