title: Process created urlhaus_21_Zoom 5.vbs
description: 'Process created: urlhaus_21_Zoom 5.vbs (urlhaus_21_Zoom 5.vbs --urlhaus-validation)'
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
    Image|endswith: urlhaus_21_Zoom 5.vbs
  selection_cmdline:
    CommandLine|contains: urlhaus_21_Zoom 5.vbs --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- Image
- CommandLine
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_21_Zoom 5.vbs (urlhaus_21_Zoom
      5.vbs --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_21_Zoom 5.vbs
      pid: 9021
      command_line: urlhaus_21_Zoom 5.vbs --urlhaus-validation
    source_behavior_tags:
    - process_create
    platform_context: windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for windows telemetry from executable
      and command line evidence using: CommandLine|contains, Image|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:18+00:00'
    source_report_hash: null
    content_hash: 3d673a60ee5c0eece8f24ca8fa4d6da39f6cd6b13d343c654f36208d3f743793
id: a3caf520-39e9-5baa-95e8-119a889abc83
