title: Process created urlhaus_46_rp_4
description: 'Process created: urlhaus_46_rp_4 (urlhaus_46_rp_4 --urlhaus-validation)'
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
    Image|endswith: urlhaus_46_rp_4
  selection_cmdline:
    CommandLine|contains: urlhaus_46_rp_4 --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- Image
- CommandLine
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_46_rp_4 (urlhaus_46_rp_4
      --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_46_rp_4
      pid: 9046
      command_line: urlhaus_46_rp_4 --urlhaus-validation
    source_behavior_tags:
    - process_create
    platform_context: windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for windows telemetry from executable
      and command line evidence using: CommandLine|contains, Image|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:18+00:00'
    source_report_hash: null
    content_hash: 7252215a2bc09524043fb9788dd715c9dca2d780000d2cfa36c4280ba345caa7
id: 7e4dad60-e4d5-5ef1-937c-f44feb9a6e4f
