title: Process created urlhaus_24_payload.sh
description: 'Process created: urlhaus_24_payload.sh (urlhaus_24_payload.sh --urlhaus-validation)'
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
    Image|endswith: urlhaus_24_payload.sh
  selection_cmdline:
    CommandLine|contains: urlhaus_24_payload.sh --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- Image
- CommandLine
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_24_payload.sh (urlhaus_24_payload.sh
      --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_24_payload.sh
      pid: 9024
      command_line: urlhaus_24_payload.sh --urlhaus-validation
    source_behavior_tags:
    - process_create
    platform_context: windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for windows telemetry from executable
      and command line evidence using: CommandLine|contains, Image|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:18+00:00'
    source_report_hash: null
    content_hash: acb76da00dc1678180fdc31a0e7271815d9cd00ed6ddb5026d7215d2a4858dd5
id: b947a38f-1275-5fc2-afb6-f3008cdcb2b5
