title: Process created urlhaus_23_m-i.p-s.SativaC2
description: 'Process created: urlhaus_23_m-i.p-s.SativaC2 (urlhaus_23_m-i.p-s.SativaC2
  --urlhaus-validation)'
logsource:
  category: process_creation
  product: linux
  service: auditd
detection:
  selection_exe:
    exe|endswith: urlhaus_23_m-i.p-s.SativaC2
  selection_cmdline:
    cmdline|contains: urlhaus_23_m-i.p-s.SativaC2 --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- exe
- cmdline
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: non_windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_23_m-i.p-s.SativaC2 (urlhaus_23_m-i.p-s.SativaC2
      --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_23_m-i.p-s.SativaC2
      pid: 9023
      command_line: urlhaus_23_m-i.p-s.SativaC2 --urlhaus-validation
    source_behavior_tags:
    - process_create
    - platform_linux_or_iot
    - platform_non_windows
    platform_context: non_windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for non_windows telemetry from executable
      and command line evidence using: cmdline|contains, exe|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:18+00:00'
    source_report_hash: null
    content_hash: 67f5c5634f307ec2bc7cf74f347d75e81cb6e716e8a5e607713317af3574a416
id: c0c3202d-a912-5fc2-9644-4d4a00c7769d
