title: Process created urlhaus_50_bin.sh
description: 'Process created: urlhaus_50_bin.sh (urlhaus_50_bin.sh --urlhaus-validation)'
logsource:
  category: process_creation
  product: linux
  service: auditd
detection:
  selection_exe:
    exe|endswith: urlhaus_50_bin.sh
  selection_cmdline:
    cmdline|contains: urlhaus_50_bin.sh --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- exe
- cmdline
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: non_windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_50_bin.sh (urlhaus_50_bin.sh
      --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_50_bin.sh
      pid: 9050
      command_line: urlhaus_50_bin.sh --urlhaus-validation
    source_behavior_tags:
    - process_create
    - family_mozi
    - platform_linux_or_iot
    - platform_non_windows
    platform_context: non_windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for non_windows telemetry from executable
      and command line evidence using: cmdline|contains, exe|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:18+00:00'
    source_report_hash: null
    content_hash: 7ad233672cc2e269df9c912062a4bb3bd52260a2d6ddde1267ee94b6c25088fe
id: 39fb1fac-8e46-568c-9d2e-72e906fa70bb
