title: Process created urlhaus_30_payload.bin
description: 'Process created: urlhaus_30_payload.bin (urlhaus_30_payload.bin --urlhaus-validation)'
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
    Image|endswith: urlhaus_30_payload.bin
  selection_cmdline:
    CommandLine|contains: urlhaus_30_payload.bin --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- Image
- CommandLine
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_30_payload.bin (urlhaus_30_payload.bin
      --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_30_payload.bin
      pid: 9030
      command_line: urlhaus_30_payload.bin --urlhaus-validation
    source_behavior_tags:
    - process_create
    platform_context: windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for windows telemetry from executable
      and command line evidence using: CommandLine|contains, Image|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:18+00:00'
    source_report_hash: null
    content_hash: 2955b79d4e088cb7c856311db8ec676d0fa828e272b9222659407efb97f1b21d
id: d44c2b12-b533-5511-b862-70b69b81ae54
