title: Process created urlhaus_16_Zoom 22.vbs
description: 'Process created: urlhaus_16_Zoom 22.vbs (urlhaus_16_Zoom 22.vbs --urlhaus-validation)'
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
    Image|endswith: urlhaus_16_Zoom 22.vbs
  selection_cmdline:
    CommandLine|contains: urlhaus_16_Zoom 22.vbs --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- Image
- CommandLine
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_16_Zoom 22.vbs (urlhaus_16_Zoom
      22.vbs --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_16_Zoom 22.vbs
      pid: 9016
      command_line: urlhaus_16_Zoom 22.vbs --urlhaus-validation
    source_behavior_tags:
    - process_create
    platform_context: windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for windows telemetry from executable
      and command line evidence using: CommandLine|contains, Image|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:17+00:00'
    source_report_hash: null
    content_hash: edceac5ac84e1a10a65955a561ea7610fcf85c7fb93b0c5292de250ff9b45506
id: 208c436c-383a-54c0-b6f3-59202e4ab7a6
