title: Process created urlhaus_19_Zoom 3.vbs
description: 'Process created: urlhaus_19_Zoom 3.vbs (urlhaus_19_Zoom 3.vbs --urlhaus-validation)'
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
    Image|endswith: urlhaus_19_Zoom 3.vbs
  selection_cmdline:
    CommandLine|contains: urlhaus_19_Zoom 3.vbs --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- Image
- CommandLine
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_19_Zoom 3.vbs (urlhaus_19_Zoom
      3.vbs --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_19_Zoom 3.vbs
      pid: 9019
      command_line: urlhaus_19_Zoom 3.vbs --urlhaus-validation
    source_behavior_tags:
    - process_create
    platform_context: windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for windows telemetry from executable
      and command line evidence using: CommandLine|contains, Image|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:18+00:00'
    source_report_hash: null
    content_hash: 1cf8373cdcc2bb35cf64df35bb0b2b62e6818d80d37c850c437caca1efb52c92
id: 0fb8e2f6-e8d1-5972-8b54-f18b60fa3341
