title: Process created urlhaus_10_Zoom 21.vbs
description: 'Process created: urlhaus_10_Zoom 21.vbs (urlhaus_10_Zoom 21.vbs --urlhaus-validation)'
logsource:
  category: process_creation
  product: windows
detection:
  selection_image:
    Image|endswith: urlhaus_10_Zoom 21.vbs
  selection_cmdline:
    CommandLine|contains: urlhaus_10_Zoom 21.vbs --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- Image
- CommandLine
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: windows
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_10_Zoom 21.vbs (urlhaus_10_Zoom
      21.vbs --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_10_Zoom 21.vbs
      pid: 9010
      command_line: urlhaus_10_Zoom 21.vbs --urlhaus-validation
    source_behavior_tags:
    - process_create
    platform_context: windows
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for windows telemetry from executable
      and command line evidence using: CommandLine|contains, Image|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:17+00:00'
    source_report_hash: null
    content_hash: f2d33805b2d24c6e1ca8a7c9e5246846673a4545e007ca832f83f35bf0261617
id: fb2fe7c7-ea4e-574a-8511-0f63df1de2db
