title: Process created urlhaus_49_bin.sh
description: 'Process created: urlhaus_49_bin.sh (urlhaus_49_bin.sh --urlhaus-validation)'
logsource:
  category: process_creation
  product: linux
  service: auditd
detection:
  selection_exe:
    exe|endswith: urlhaus_49_bin.sh
  selection_cmdline:
    cmdline|contains: urlhaus_49_bin.sh --urlhaus-validation
  condition: all of them
level: medium
status: experimental
author: malware-behavior-detection-generator
tags:
- attack.t1059
references:
- generated-by:malware-behavior-detection-generator
- source:cuckoo
falsepositives:
- Unknown
fields:
- exe
- cmdline
metadata:
  tool: malware-behavior-detection-generator
  behavior_category: process
  platform_context: linux_or_iot
  trace:
    source_behavior_category: process
    source_behavior_description: 'Process created: urlhaus_49_bin.sh (urlhaus_49_bin.sh
      --urlhaus-validation)'
    source_behavior_evidence:
    - process_name: urlhaus_49_bin.sh
      pid: 9049
      command_line: urlhaus_49_bin.sh --urlhaus-validation
    source_behavior_tags:
    - process_create
    - arch_mips
    - family_mozi
    - format_elf
    - platform_linux_or_iot
    - platform_non_windows
    platform_context: linux_or_iot
    attack_technique_ids:
    - T1059
    attack_tags:
    - attack.t1059
    selector_reason: 'Process selector chosen for linux_or_iot telemetry from executable
      and command line evidence using: cmdline|contains, exe|endswith.'
  review:
    status: unreviewed
    reviewer: ''
    notes: ''
  version:
    tool_name: malware-behavior-detection-generator
    tool_version: 0.1.0
    rule_version: 1.0.0
    generated_at: '2026-07-01T10:00:18+00:00'
    source_report_hash: null
    content_hash: 2a0e2fbd27f255116074173ef9719b6028868b2828f93659acfbee60dce46125
id: 7dc90987-e630-53cf-bc4b-26753e707a24
